#  DATA  PRE-PROCESSING

In [ ]:
STEPS  IN  DATA  PRE-PROCESSING:
    
    # 1. acquire the dataset
    # 2.import the crucial libraries
    # 3.handle the missing values
    #4. handle categorical values
    #5. feature scaling
    #6. train and test.

In [ ]:
when it  comes  to  build a   machine  learning  model  ,  the  data-  pre processing  is the  first step marking  the 
initiation of  the  process.typically  whatever  the  real  world  data  collceted  will  be  incomplete ,  inconsistent  and
also inaccurate (that means that  have  some sort  of  errors  or some  sort of  outliers).


An  often the  data  lacks  specific  attributes, values  (or) trends  and we  call them  as missing  values.  There is  where
your  data-preprocessing   technique  comes to  the scenario.

The  data pre-processing  techique  helps  to  clean  the  data ,  order  the  data,  organize  the  raw data .  This  makes 
your  data  ready  to  go  the  machine learning  model  .

The  data  pre-processing  plays a  key  role  in  your workflow.  you  actually  need to  transform the  data  in  a way that
a  computer  would  be  able  to  work  with  it.

The  data-preprocessing  in  machine learning is  a crucial  step  that enhances the quality  of  the  data  to  promote  the  
extraction of  meaningfull  insights  from the  data .

Data-preprocessing  refers  to  the  technique  of preparing  the  data  that  is  cleaning and  organising the  raw  data
to  make it  suitable  for  building  a machine  learning  model.

In simple   words, data-preprocessing  and  machine  learning  is  a  data  mining  technique thst  transforms the  raw  data 
into understandable  nad  readable  format..

In [ ]:
#  HANDLING  CATEGORICAL  VALUES:

categorical  data  or  categorical  values  refer  to  the  information that  has  specific  category in  the  dataset that
is  textual data  in  columns .so,  we  have  to  encode the  categorical data in  the  numbers.

to  do  so  we  use  LABEL ENCODING

#    LABEL ENCODING

In [3]:
# importing the libraries

import pandas as pd
import numpy as np

In [4]:
# reading  the  datset

dataset = pd.read_csv(r"C:\Users\Ravi Teja\Downloads\Churn_Modelling.CSV")

In [5]:
dataset.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [6]:
from sklearn.preprocessing import LabelEncoder  #  here, we  have imported  the  labelencoder  from  the package
le = LabelEncoder()   #  sklearn
dataset["Geography"] = le.fit_transform(dataset["Geography"]) # here  ,  we  are  transforming  the categorical  data
dataset["Gender"] = le.fit_transform(dataset["Gender"]) # into  numerical  data.

In [7]:
"Geography"

'Geography'

In [8]:
dataset.head(10)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,0,0,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,2,0,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,0,0,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,0,0,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,2,0,43,2,125510.82,1,1,1,79084.10,0
5,6,15574012,Chu,645,2,1,44,8,113755.78,2,1,0,149756.71,1
6,7,15592531,Bartlett,822,0,1,50,7,0.00,2,1,1,10062.80,0
7,8,15656148,Obinna,376,1,0,29,4,115046.74,4,1,0,119346.88,1
8,9,15792365,He,501,0,1,44,4,142051.07,2,0,1,74940.50,0
9,10,15592389,H?,684,0,1,27,2,134603.88,1,1,1,71725.73,0

In [9]:
France, Germany , Spain
France - 0
Germany - 1
Spain - 2
America, atlantica, Newyork , newjersey
America - 0  
atlantica - 1
Newyork - 2
newjersey - 3

NameError: name 'France' is not defined

#  ONEHOT ENCODING

In [ ]:
so,  whenever  you  are  building  a  machine  learning  model .  The  machine  learning  model  assume  that there  is  some 
sort  of  correlation  between three  variables.  so, if  such  sort  of  scenario  happens .  hence  there  will  be
some sort  of  faulty  output.so,  to  eliminate  this  issue we  will  use  something  called  "ONEHOTENCODING".


so,  here  this "ONEHOTENCODING"  is  used  to remove  some  sort of  priority  or  remove  some  sort  of  correlation.

for  example ,  if  italy  is  coded  as = 0 , germany as = 1 and  spain as  = 3  then  there  is  no higher  priorty  
among  them  and  there  is  no  correlation  between  among them  .  so,  to   remove  this  kin  of  problems,  we'
 are  using  the ONEHOTENCODING.


    But  before  entering  into  the ONEHOTENCODING  we  have to  divide  our data  into  the  dependent  and
    independent  variables.

In [10]:
dataset

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,0,0,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,2,0,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,0,0,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,0,0,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,2,0,43,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,15606229,Obijiaku,771,0,1,39,5,0.00,2,1,0,96270.64,0
9996,9997,15569892,Johnstone,516,0,1,35,10,57369.61,1,1,1,101699.77,0
9997,9998,15584532,Liu,709,0,0,36,7,0.00,1,0,1,42085.58,1
9998,9999,15682355,Sabbatini,772,1,1,42,3,75075.31,2,1,0,92888.52,1
9999,10000,15628319,Walker,792,0,0,28,4,130142.79,1,1,0,38190.78,0

In [12]:
type(dataset)

pandas.core.frame.DataFrame

In [13]:
dataset.isnull().any()

RowNumber          False
CustomerId         False
Surname            False
CreditScore        False
Geography          False
Gender             False
Age                False
Tenure             False
Balance            False
NumOfProducts      False
HasCrCard          False
IsActiveMember     False
EstimatedSalary    False
Exited             False
dtype: bool

In [14]:
dataset.head(10)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,0,0,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,2,0,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,0,0,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,0,0,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,2,0,43,2,125510.82,1,1,1,79084.10,0
5,6,15574012,Chu,645,2,1,44,8,113755.78,2,1,0,149756.71,1
6,7,15592531,Bartlett,822,0,1,50,7,0.00,2,1,1,10062.80,0
7,8,15656148,Obinna,376,1,0,29,4,115046.74,4,1,0,119346.88,1
8,9,15792365,He,501,0,1,44,4,142051.07,2,0,1,74940.50,0
9,10,15592389,H?,684,0,1,27,2,134603.88,1,1,1,71725.73,0

In [15]:
dataset['Geography'].fillna(dataset['Geography'].mode()[0],inplace = True)
dataset['Age'].fillna(dataset['Age'].mean(),inplace = True)
dataset['Balance'].fillna(dataset['Balance'].median(),inplace = True)

In [16]:
dataset.isnull().any()

RowNumber          False
CustomerId         False
Surname            False
CreditScore        False
Geography          False
Gender             False
Age                False
Tenure             False
Balance            False
NumOfProducts      False
HasCrCard          False
IsActiveMember     False
EstimatedSalary    False
Exited             False
dtype: bool

In [17]:
dataset.head(10)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,0,0,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,2,0,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,0,0,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,0,0,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,2,0,43,2,125510.82,1,1,1,79084.10,0
5,6,15574012,Chu,645,2,1,44,8,113755.78,2,1,0,149756.71,1
6,7,15592531,Bartlett,822,0,1,50,7,0.00,2,1,1,10062.80,0
7,8,15656148,Obinna,376,1,0,29,4,115046.74,4,1,0,119346.88,1
8,9,15792365,He,501,0,1,44,4,142051.07,2,0,1,74940.50,0
9,10,15592389,H?,684,0,1,27,2,134603.88,1,1,1,71725.73,0

In [19]:
p = dataset['Geography'].mode()

In [20]:
p

0    0
dtype: int32

In [21]:
p[0]

0

In [22]:
dataset['Geography'].mode()[0]

0

In [23]:
x = dataset.iloc[:,3:13]
y = dataset.iloc[:,13:14]

In [24]:
x  #  here ,  x  is  considered  as  the  dependent variable.

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,619,0,0,42,2,0.00,1,1,1,101348.88
1,608,2,0,41,1,83807.86,1,0,1,112542.58
2,502,0,0,42,8,159660.80,3,1,0,113931.57
3,699,0,0,39,1,0.00,2,0,0,93826.63
4,850,2,0,43,2,125510.82,1,1,1,79084.10
...,...,...,...,...,...,...,...,...,...,...
9995,771,0,1,39,5,0.00,2,1,0,96270.64
9996,516,0,1,35,10,57369.61,1,1,1,101699.77
9997,709,0,0,36,7,0.00,1,0,1,42085.58
9998,772,1,1,42,3,75075.31,2,1,0,92888.52
9999,792,0,0,28,4,130142.79,1,1,0,38190.78

In [25]:
y #  here ,  y  is  considered  as  the  independent variable.

      Exited
0          1
1          0
2          1
3          0
4          0
...      ...
9995       0
9996       0
9997       1
9998       1
9999       0

[10000 rows x 1 columns]

In [26]:
 #  SO,  here  in  this  below  code  we  are  extracting  all  the independent  variables.
    
    
x = dataset.iloc[:,3:13]  #  here , the  first  indentation is  for  extracting all  the  rows  and  the  second  one
y = dataset.iloc[:,13:14] #  for  extracting  the  columns only.

In [27]:
x.shape  #  it  tells  us  that the  x  dependent  variable  has  the  10,000  rows  and 10  columns.

(10000, 10)

In [28]:
y.shape

(10000, 1)

In [29]:
type(x)

pandas.core.frame.DataFrame

In [30]:
type(y)

pandas.core.frame.DataFrame

In [156]:
#  TO   BUILD  A  MACHINE LEARNING MODEL, YOU  HAVE  TO  CONVERT  THIS  DATAFRAME  INTO  NUMPY ARRAYS .YOU  CANNOT  TRAIN
#  A  MACHINE  LEARNING  MODEL DIRCTLY  WITH  DATAFRAME.  SO,  WE  HAVE  TO  CONVERT  THEM  INTO NUMPY  ARRAYS.

In [157]:
#  SO,  IN  THE  BELOW  CODE  WE  ARE  CONVERTING  THE DATAFRAME FROM  PANDAS  TO  NUMPY  SEE IT:

In [31]:
 #  SO,  here  in  this  below  code  we  are  extracting  all  the independent  variables.
    
    
x = dataset.iloc[:,3:13].values  #  here,  by using  the  values we  are  converting  the  dataset into numpy
y = dataset.iloc[:,13:14].values

In [32]:
type(x)

numpy.ndarray

In [33]:
type(y)

numpy.ndarray

In [34]:
x  #  here,  we  can see  in  the x  we  have  the  "arrays"  of  2  dimensional.

array([[6.1900000e+02, 0.0000000e+00, 0.0000000e+00, ..., 1.0000000e+00,
        1.0000000e+00, 1.0134888e+05],
       [6.0800000e+02, 2.0000000e+00, 0.0000000e+00, ..., 0.0000000e+00,
        1.0000000e+00, 1.1254258e+05],
       [5.0200000e+02, 0.0000000e+00, 0.0000000e+00, ..., 1.0000000e+00,
        0.0000000e+00, 1.1393157e+05],
       ...,
       [7.0900000e+02, 0.0000000e+00, 0.0000000e+00, ..., 0.0000000e+00,
        1.0000000e+00, 4.2085580e+04],
       [7.7200000e+02, 1.0000000e+00, 1.0000000e+00, ..., 1.0000000e+00,
        0.0000000e+00, 9.2888520e+04],
       [7.9200000e+02, 0.0000000e+00, 0.0000000e+00, ..., 1.0000000e+00,
        0.0000000e+00, 3.8190780e+04]])

In [35]:
x.shape

(10000, 10)

In [36]:
y.shape

(10000, 1)

In [37]:
type(x)

numpy.ndarray

In [38]:
from sklearn.preprocessing import OneHotEncoder
one = OneHotEncoder()
z = one.fit_transform(x[:,1:2]).toarray()
w = one.fit_transform(x[:,2:3]).toarray()

In [39]:
z  # THis  is   geography column

array([[1., 0., 0.],
       [0., 0., 1.],
       [1., 0., 0.],
       ...,
       [1., 0., 0.],
       [0., 1., 0.],
       [1., 0., 0.]])

In [40]:
w  #  this  is  gender  column.

array([[1., 0.],
       [1., 0.],
       [1., 0.],
       ...,
       [1., 0.],
       [0., 1.],
       [1., 0.]])

In [ ]:
# This  ONEHOTENCODING  actually  creates  extra columns for  each  and  every  categorical  data.

that  is  in geography  we  have  3 unique  values  so  3  columns  will  be  generated.
so, in  the  same  way  the gender have  2   unique  values  , so 2 columns  will  be  generated.

In [171]:
#  here  we   are  representing  the  geography  and  gender  acc. to the  number  in  the  order  they  arrived or represented

#  in  the  dataset.

france  germany     spain
1        0            0     #  here, 1  in  france  represent  that   france  was  present  and  others  were  not  there.
1        0            0
1        0            0
1        0            0
1        0            0
0        0            1 
0        1            0



FEMALE    MALE

1          0
1          0
1          0
1          0
1          0
0          1

(10000, 10)

In [41]:
x.shape

(10000, 10)

In [42]:
x = np.delete(x, [1,2] , axis = 1) #  here,  we  have  removed  the  2  columns  ,  the  axis  =1  is  specifying that

#  we  are  deleting the  columns only .

In [43]:
x.shape

(10000, 8)

In [44]:
x  =  np.concatenate((w,z,x), axis = 1)  #  here  we  are  adding  the  w, z, x  columns  wise

In [45]:
x.shape  #  previously  there  was  only  8  columns  but   after  the  concatenation  the  no.  of  columns  was  increased  to

#  13 because  we  have  added  3 geography columns(x)   +  2 gender columns(z) + other 8  columns of x

(10000, 13)

#  COLUMN  TRANSFORMING :

In [ ]:
#  COLUMN  TRANSFORM :    the  column  transform  will  combine  the  labelencoder   and  onehotencoding  into
 # single  transformation.

In [46]:
from sklearn.compose import ColumnTransformer
from sklearn.pipeline import Pipeline

In [47]:
x1 = dataset.iloc[:,3:13].values
y1 = dataset.iloc[:,13:14].values

In [48]:
ct = ColumnTransformer([("oh",OneHotEncoder(),[1,2])], remainder = "passthrough")  # now,  whatever  happens with the

# functions  labelencoder   and  onehotencoder   the  same  happens  with  the   columntransfer  also.

In [49]:
ct

ColumnTransformer(n_jobs=None, remainder='passthrough', sparse_threshold=0.3,
                  transformer_weights=None,
                  transformers=[('oh',
                                 OneHotEncoder(categories='auto', drop=None,
                                               dtype=<class 'numpy.float64'>,
                                               handle_unknown='error',
                                               sparse=True),
                                 [1, 2])],
                  verbose=False)

In [53]:
x1 = ct.fit_transform(x1)

In [54]:
x1.shape

(10000, 15)

In [55]:
import  joblib
joblib.dump(ct, "column")   #  here,  basically  we  have  imported  the  joblib file  and  we  are  dumoing  the  values  

#  of  the columntransfer  that  is  onehotencoded  and  labelencoded  values.  so,  that  it can  be  usefull  in  the inverse

#  transform  of  the  binary  values 



#  so, we  have  used  the onehotencoding  and  labelencoding there  the  inverse transformed  or  those  binary  values
# into categories  will  be  some  what  difficult  .  but  with  the  column  transform we  can  directly  inverse  those
#  binary  values into categorical values with  the  help of  this  file

['column']

#  SPLITTING THE DATA INTO  TRAIN  AND TEST

In [ ]:
The  train  set  is  used  to  train  the  datset  and  the  test  datset  is  used  to  test   the data  for  its accuracy
and  other  parameters.

USUALLY  the  dataset  is  split  into  80:20  ratio  or  70:30  ratio   this  means  either  we  take  80  or  70  percent
for  training the dataset  and  20  or  30  percent  of  data  for  testing .

In [56]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(x1,y1,test_size = 0.2 , random_state = 0)


#  here,  firstly we  had  imported  the train and test  library.

# the x train here is  nothing  but  the  features  of  training  ,  x  test  is  nothing but the  features  of testing,

# y   train  is  dependent varibales  for training.  y  test  dependent  variables  for  testing.

#  random  state  is  nothing  but it  will  split  the  data  randomly

In [57]:
x_train.shape

(8000, 15)

In [58]:
x_test.shape

(2000, 15)

In [60]:
a = [1,2,3,4,5,6,7,8,9,10]
b = [0,1,0,1,0,1,0,1,0,1]

In [64]:
for i in range(5):
    atrain,atest,btrain,btest = train_test_split(a,b,test_size = 0.2)
    print(atrain)
    
    #  here,  we  have  not  used  the random  state  and   every  data  is  splitted

[8, 10, 3, 6, 5, 9, 4, 1]
[5, 8, 7, 1, 9, 2, 10, 6]
[3, 4, 1, 10, 9, 5, 2, 6]
[1, 6, 2, 10, 9, 3, 4, 8]
[5, 1, 9, 6, 7, 3, 10, 2]

In [66]:
for i in range(5):
    atrain,atest,btrain,btest = train_test_split(a,b,test_size = 0.2,random_state = 0)
    print(atrain)  
    
    #  here,  we  have  used the  random state  so   every split has  the  same data  for  every  row

[5, 10, 2, 7, 8, 4, 1, 6]
[5, 10, 2, 7, 8, 4, 1, 6]
[5, 10, 2, 7, 8, 4, 1, 6]
[5, 10, 2, 7, 8, 4, 1, 6]
[5, 10, 2, 7, 8, 4, 1, 6]

#  FEATURE  SCALING:

The  FEATURE SCALING  is  a method  to  standardise  the  independent  variabkes of the  dataset  with a  specific range.
so, feature  scaling  limits  the   range of variable.so, that  you  can  compare them on common  grounds.

In [ ]:
new =  x-mean(x)/std (-1,1)   #  so,  feature scaling  is nothing  but  the  converting the varibales into a  particular range.

#  the  feature  scaling  also  avoids  the  outliers

#  the  standard  scaling  don't have any  particular  range.

# but  the  min- max  scaler  will have  the range  between the  -1 to  1 .

In [68]:
#  here, in the  below  code   we  are  appliying  the  feature  scaling 

from  sklearn.preprocessing import StandardScaler
sc = StandardScaler()
x_train = sc.fit_transform(x_train)
x_test = sc.transform(x_test)